# WireType Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireType Class
Members See Also
---
Represents a specific wire type.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class WireType : ElementType
```

Visual Basic
---
```text
Public Class WireType _
	Inherits ElementType
```

Visual C++
---
```text
public ref class WireType : public ElementType
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB.Electrical..::..WireType
# See Also
WireType Members
Autodesk.Revit.DB.Electrical Namespace